/* 
  Localizable.strings
  ownCloud

  Created by Pablo Carrascal on 13/03/2018.
  Copyright © 2018 ownCloud GmbH. All rights reserved.
*/

/*
 * Copyright (C) 2018, ownCloud GmbH.
 *
 * This code is covered by the GNU Public License Version 3.
 *
 * For distribution utilizing Apple mechanisms please see https://owncloud.org/contribute/iOS-license-exception/
 * You should have received a copy of this license along with this program. If not, see <http://www.gnu.org/licenses/gpl-3.0.en.html>.
 *
 */

/* Add / Edit Bookmark */
"Edit bookmark" = "แก้ไขรายการโปรด";
"Add bookmark" = "เพิ่มรายการโปรด";
"Server URL" = "URL ของเซิร์ฟเวอร์";
"https://example.com" = "https://example.com";
"Continue" = "ดำเนินการต่อ";
"Name" = "ชื่อ";
"Example Server" = "เซิร์ฟเวอร์ตัวอย่าง";
"Show Certificate Details" = "แสดงรายละเอียดใบรับรอง";
"Connect" = "เชื่อมต่อ";
"Delete Authentication Data" = "ลบข้อมูลการรับรองความถูกต้อง";
"Authentication" = "รับรองความถูกต้อง";
"Username" = "ชื่อผู้ใช้";
"Password" = "รหัสผ่าน";
"Certificate Details" = "รายละเอียดใบรับรอง";
"Cancel" = "ยกเลิก";
"Approve" = "อนุมัติ";
"Error" = "ข้อผิดพลาด";
"Review Connection" = "ตรวจสอบการเชื่อมต่อ";
"Authenticated via" = "ตรวจสอบแล้วผ่านทาง";
"Authenticated as %@ via %@" = "รับรองความถูกต้องด้วย %@ ผ่านทาง %@";

"Contacting server…" = "กำลังติดต่อเซิร์ฟเวอร์...";
"Authenticating…" = "กำลังตรวจสอบสิทธิ์...";

"Missing hostname" = "ไม่มีชื่อโฮสต์";
"The entered URL does not include a hostname." = "ป้อน URL โดยไม่รวมชื่อโฮสต์";

/* Client */
"Browse" = "เรียกดู";
"Disconnect" = "ตัดการเชื่อมต่อ";
"Connecting…" = "กำลังเชื่อมต่อ...";
"Connected." = "เชื่อมต่อแล้ว";

"Folder" = "แฟ้มเอกสาร";

"Stopped" = "หยุดแล้ว";
"Started…" = "เริ่มต้นแล้ว...";
"Contents from cache." = "เนื้อหาจากแคช";
"Offline. Contents from cache." = "เนื้อหาจากแคชแบบออฟไลน์";
"Waiting for server response…" = "กำลังรอการตอบกลับของเซิร์ฟเวอร์...";
"This folder no longer exists." = "โฟลเดอร์นี้ไม่มีอยู่แล้ว";
"Everything up-to-date." = "ทุกอย่างใหม่ล่าสุดแล้ว";
"Please wait…" = "โปรดรอ…";
"Sorted by %@ ▼" = "จัดเรียงตาม %@ ▼";
"Sort by" = "เรียงตาม";

"name (A-Z)" = "ชื่อ (A-Z)";
"name (Z-A)" = "ชื่อ (Z-A)";
"type" = "ชนิด";
"size" = "ขนาด";
"date" = "วันที่";
"Search this folder" = "ค้นหาโฟลเดอร์นี้";

/* Client Messages */
"Empty folder" = "โฟลเดอร์ว่างเปล่า";
"This folder contains no files or folders." = "โฟลเดอร์นี้ไม่มีไฟล์หรือโฟลเดอร์";

"Folder removed" = "ลบโฟลเดอร์แล้ว";
"This folder no longer exists on the server." = "โฟลเดอร์นี้ไม่มีอยู่บนเซิร์ฟเวอร์อีกต่อไป";

/* Server List*/
"Cancel" = "ยกเลิก";
"OK" = "ตกลง";

"'%@' is currently locked" = "'%@' ปัจจุบันถูกล็อกอยู่";
"An operation is currently performed that prevents connecting to '%@'. Please try again later." = "ขณะนี้มีการดำเนินการเพื่อป้องกันการเชื่อมต่อไปยัง '%@' กรุณาลองใหม่อีกครั้งในภายหลัง";
"Really delete '%@'?" = "ต้องการลบ '%@'?";
"This will also delete all locally stored file copies." = "นอกจากนี้จะลบไฟล์สำเนาที่เก็บไว้ในเครื่องทั้งหมด";
"Delete" = "ลบ";
"Deletion of '%@' failed" = "การลบ '%@' ล้มเหลว";

/* Settings Messages */

"Security" = "ความปลอดภัย";
"Passcode Lock" = "ล็อกรหัสผ่าน";
"Face ID" = "ปลดล็อคด้วยใบหน้า";
"Touch ID" = "ยืนยันตนด้วยลายนิ้วมือ";
"Instant Uploads" = "อัพโหลดทันที";
"Videos" = "วิดีโอ";
"Photos" = "รูปภาพ";
"Background uploads" = "อัพโหลดพื้นหลัง";
"Wifi only" = "Wifi เท่านั้น";
"Settings" = "ตั้งค่า";
"Lock application" = "ล็อกแอพพลิเคชัน";
"Upload videos via WiFi only" = "อัพโหลดวีดีโอผ่านทาง WiFi เท่านั้น";
"Upload pictures via WiFi only" = "อัพโหลดรูปภาพผ่านทาง WiFi เท่านั้น";
"More" = "ขยาย";
"Send feedback" = "ส่งความคิดเห็น";
"Recommend to a friend" = "แนะนำให้เพื่อน";
"Privacy Policy" = "นโยบายส่วนบุคคล";
"Video upload path" = "เส้นทางการอัพโหลดวิดีโอ";
"Photo upload path" = "เส้นทางการอัพโหลดภาพ";
"Always" = "เสมอ";
"After 1 minute" = "หลังจากผ่านไป 1 นาที";
"After 5 minutes" = "หลังจากผ่านไป 5 นาที";
"After 30 minutes" = "หลังจากผ่านไป 30 นาที";
"Please configure an email account" = "โปรดกำหนดค่าบัญชีอีเมล";
"You need to configure an email account first to be able to send emails." = "คุณต้องกำหนดค่าบัญชีอีเมลก่อนจึงจะสามารถส่งอีเมลได้";
"Do you want to open the next url?" = "คุณต้องการเปิด URL ถัดไป?";

/* Passcode Messages */

"Enter code" = "ใส่รหัส";
"Repeat code" = "ใส่รหัสอีกครั้ง";
"Delete code" = "ลบรหัส";
"The entered codes are different" = "กรุณาป้อนรหัสให้ตรงกัน";
"Incorrect code" = "รหัสไม่ถูกต้อง";
"Please try again in %@" = "โปรดลองอีกครั้งใน %@";
"Unlock %@" = "ปลดล็อค %@";
"Biometric authentication failed" = "การตรวจสอบสิทธิ์แบบไบโอเมตริกซ์ล้มเหลว";
